Ran Plan for 2 projects:

1. dir: `infrastructure/gcp/cloud-deployment/gcloud-dns-ols` workspace: `default`
1. dir: `infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis` workspace: `default`

### 1. dir: `infrastructure/gcp/cloud-deployment/gcloud-dns-ols` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform init -input=false -upgrade" in "/home/atlantis/.atlantis/repos/greyhats13/ol_shop/7/default/infrastructure/gcp/cloud-deployment/gcloud-dns-ols": exit status 1

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.
Upgrading modules...
- gcloud_dns in 
╷
│ Error: Unreadable module directory
│ 
│ Unable to evaluate directory symlink: lstat
│ ../../modules/security/gcloud-dns: no such file or directory
╵

╷
│ Error: Unreadable module directory
│ 
│ The directory  could not be read for module "gcloud_dns" at main.tf:11.
╵


```
</details>

---
### 2. dir: `infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/greyhats13/ol_shop/7/default/infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis/default.tfplan\"" in "/home/atlantis/.atlantis/repos/greyhats13/ol_shop/7/default/infrastructure/gcp/cloud-deployment/gcompute-engine-atlantis": exit status 1
data.terraform_remote_state.gcloud_dns_ols: Reading...
data.terraform_remote_state.gkubernetes_engine_ols: Reading...
data.terraform_remote_state.kms_ols_cryptokey: Reading...
data.terraform_remote_state.vpc_ols_network: Reading...
data.terraform_remote_state.gcloud_dns_ols: Read complete after 0s
module.gcompute-engine.tls_private_key.tls: Refreshing state... [id=a74a33b125ed5f7a9f85a4eeb0334dc7a51e91a6]
data.terraform_remote_state.gkubernetes_engine_ols: Read complete after 0s
data.terraform_remote_state.vpc_ols_network: Read complete after 0s
module.gcompute-engine.local_file.private_key: Refreshing state... [id=8fb4e61e423f4cfe2de8dac17b00cac313faa04c]
data.terraform_remote_state.kms_ols_cryptokey: Read complete after 0s
module.gcompute-engine.google_compute_firewall.firewall["https"]: Refreshing state... [id=projects/onlineshop-378118/global/firewalls/ols-dev-gce-atlantis-allow-https]
data.google_kms_secret.github_token: Reading...
data.google_kms_secret.github_webhook_secret: Reading...
module.gcompute-engine.google_service_account.sa: Refreshing state... [id=projects/onlineshop-378118/serviceAccounts/ols-dev-gce-atlantis@onlineshop-378118.iam.gserviceaccount.com]
data.google_project.current: Reading...
module.gcompute-engine.google_compute_firewall.firewall["atlantis"]: Refreshing state... [id=projects/onlineshop-378118/global/firewalls/ols-dev-gce-atlantis-allow-atlantis]
module.gcompute-engine.google_compute_firewall.firewall["ssh"]: Refreshing state... [id=projects/onlineshop-378118/global/firewalls/ols-dev-gce-atlantis-allow-ssh]
module.gcompute-engine.google_compute_firewall.firewall["http"]: Refreshing state... [id=projects/onlineshop-378118/global/firewalls/ols-dev-gce-atlantis-allow-http]
data.google_kms_secret.github_webhook_secret: Read complete after 0s [id=projects/onlineshop-378118/locations/global/keyRings/ols-dev-gcloud-kms-keyring/cryptoKeys/ols-dev-gcloud-kms-cryptokey:CiQAu5Ik/vwWEgwN6p/7QGs/TqpiT0FQqbD21Ire6zWKO0OTm4oSqgEA+ExmB4tZTSnGfF7suBlO/rI0atd0LT5k5R3l9yW+gfh0MNNeYTfrLPla33y6F4jszEV7oI0j5anCGBCFPfZZvUWTMNwUFwHWPVhDaoktmziEoT5V7F5aWQXuWGa4/6ze0SgVOa2RB1vz8MzYY8OvOGr9MhAlGGK6d9fF/8bUuvQPnEe2b8akk8zPzejuGVNh9eQezbVA1NR36SThZkUC7gMfy4Rs+veLJA==]
data.google_kms_secret.github_token: Read complete after 0s [id=projects/onlineshop-378118/locations/global/keyRings/ols-dev-gcloud-kms-keyring/cryptoKeys/ols-dev-gcloud-kms-cryptokey:CiQAu5Ik/sYgtQ6T67TP+y1iDZ7NH2RNMqmiUX9bx+kUYx4XWAISUQD4TGYHZkwvilAV6LtBVLlYM9K6WKA14AYLjo+BAVp1pA36/pqU09nuiu7aw6oznBJGxz91MpoT30W5Y6YotoKmEluxdLEtWWVjRcE9V8SRJg==]
data.google_project.current: Read complete after 3s [id=projects/onlineshop-378118]
module.gcompute-engine.google_project_iam_member.sa_iam: Refreshing state... [id=onlineshop-378118/roles/owner/serviceAccount:ols-dev-gce-atlantis@onlineshop-378118.iam.gserviceaccount.com]
module.gcompute-engine.google_compute_instance.instance: Refreshing state... [id=projects/onlineshop-378118/zones/asia-southeast2-a/instances/ols-dev-gce-atlantis]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.gcompute-engine.local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0400"
      + filename             = "private_key.pem"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: Unsupported attribute
│ 
│   on main.tf line 112, in module "gcloud-dns-record":
│  112:   dns_zone_name = data.terraform_remote_state.gcloud_dns_ols.outputs.dns_zone_name
│     ├────────────────
│     │ data.terraform_remote_state.gcloud_dns_ols.outputs is object with 5 attributes
│ 
│ This object does not have an attribute named "dns_zone_name".
╵


```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`